cf_billing/InformationRegisters/энргНастройкиНачисленияПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНастройкиНачисленияПени</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГлубинаОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайнийСрокОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяГлубинаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РассчитыватьНаТекущуюДату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНастройкиНачисленияПени/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс	

#Область ПолучениеДанных

// Получает настройки начисления пени.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ПолучитьНастройкиНачисленияПени(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНастройкиНачисленияПени());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения; 
	Пакет.ВыбиратьРазрешенные 				= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	
	ОператорВыбора 							= Пакет.Операторы[0];	
	Источник 								= ОператорВыбора.Источники[0].Источник;
	Параметры 								= Источник.Параметры;
	
	ПараметрПериод 							= Параметры[0];
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	ИначеЕсли НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 			= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 			= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 					= "Организация, Район";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(Параметры[1], ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
	ВспомогательныеПоля 					= "Период,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 				= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 						= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры  

#Область ГИСЖКХ

// Заполняет схему срез последних.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуСрезПоследних(Схема,ПараметрыСхемы,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема 								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗаполнитьСхемуСрезПоследних());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения;
	Оператор 								= Пакет.Операторы[0];
	Источник 								= Оператор.Источники[0].Источник;
	Если ПараметрыСхемы.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 					= "Организация,Район";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(Источник.Параметры[1], ПараметрыСхемы.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаНастройкиНачисленияПени()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргНастройкиНачисленияПениСрезПоследних.Организация КАК Организация,
	|	энргНастройкиНачисленияПениСрезПоследних.Район КАК Район,
	|	энргНастройкиНачисленияПениСрезПоследних.ГлубинаОтсрочки КАК ГлубинаОтсрочки,
	|	энргНастройкиНачисленияПениСрезПоследних.КрайнийСрокОплаты КАК КрайнийСрокОплаты,
	|	энргНастройкиНачисленияПениСрезПоследних.МаксимальнаяГлубинаЗадолженности КАК МаксимальнаяГлубинаЗадолженности
	|ИЗ
	|	РегистрСведений.энргНастройкиНачисленияПени.СрезПоследних КАК энргНастройкиНачисленияПениСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаЗаполнитьСхемуСрезПоследних()
	
	Текст = 
	"ВЫБРАТЬ
	|	НастройкиНачисленияПени.Период КАК Период,
	|	НастройкиНачисленияПени.Организация КАК Организация,
	|	НастройкиНачисленияПени.Район КАК Район,
	|	НастройкиНачисленияПени.ГлубинаОтсрочки КАК ГлубинаОтсрочки,
	|	НастройкиНачисленияПени.КрайнийСрокОплаты КАК КрайнийСрокОплаты,
	|	НастройкиНачисленияПени.МаксимальнаяГлубинаЗадолженности КАК МаксимальнаяГлубинаЗадолженности
	|ИЗ
	|	РегистрСведений.энргНастройкиНачисленияПени.СрезПоследних КАК НастройкиНачисленияПени";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
